Examinator/src/InformationRegisters/ДанныеВебКабинетаСУО_ОН/ДанныеВебКабинетаСУО_ОН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВебКабинетаСУО_ОН</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.ФорматыВебДанныхСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДанныхВебКабинетаСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеВебКабинетаСУО_ОН/ManagerModule.bsl
Процедура ДобавитьДанные(Тип, Объект, Данные, Формат) Экспорт
	
	НаборЗаписей = РегистрыСведений.ДанныеВебКабинетаСУО_ОН.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Тип.Установить(Тип);
	НаборЗаписей.Отбор.Объект.Установить(Объект);

	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Тип = Тип;
	НоваяЗапись.Объект = Объект;
	
	НоваяЗапись.Данные = Новый ХранилищеЗначения(Данные);
	НоваяЗапись.Формат = Формат;
	НоваяЗапись.ДатаИзменения = ТекущаяДатаСеанса();

	НаборЗаписей.Записать();		
	
КонецПроцедуры

Процедура УдалитьДанные(Объект, Тип=Неопределено) Экспорт
	
	НаборЗаписей = РегистрыСведений.ДанныеВебКабинетаСУО_ОН.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Объект.Установить(Объект);
	
	Если Тип <> Неопределено Тогда
		НаборЗаписей.Отбор.Тип.Установить(Тип);	
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
